Revit 2026 API

# RouteAnalysisSettingsSetIgnoredCategoryIds Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetIgnoredCategoryIds(
	ICollection<ElementId> categoryIds
)
```
```vb
Public Sub SetIgnoredCategoryIds (
	categoryIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetIgnoredCategoryIds(
	ICollection<ElementId^>^ categoryIds
)
```
```fsharp
member SetIgnoredCategoryIds :
        categoryIds : ICollection<ElementId> -> unit
```

#### Parameters

categoryIds ICollectionElementId

#### Reference

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace